In [2]:
import pandas as pd

In [19]:
df1 = pd.read_csv(r'C:\Users\lokes\OneDrive\Desktop\python\pandas\homes.csv')
df2 = pd.read_csv(r'C:\Users\lokes\OneDrive\Desktop\python\pandas\homes_1.csv')
df_homes = pd.read_csv(r'C:\Users\lokes\OneDrive\Desktop\python\pandas\homes_complete.csv')

In [20]:
df1

           Address    Price  Bedrooms
0      123 Main St   99,000         1
1  4981 Anytown Rd  199,000         4
2   132 Walrus ave  299,001         2
3    1506 Guido St  784,049         3

In [21]:
df2

          Address    Price  Bedrooms
0   491 Python St  293,923         4
1     938 Zeal Rd  148,398         2
2     247 Fort St  299,238         3
3  992 Settled St  823,049         4

In [22]:
df_homes

           Address    Price  Bedrooms
0      123 Main St   99,000         1
1  4981 Anytown Rd  199,000         4
2   132 Walrus ave  299,001         2
3    1506 Guido St  784,049         3
4    491 Python St  293,923         4
5      938 Zeal Rd  148,398         2
6      247 Fort St  299,238         3
7   992 Settled St  823,049         4

In [25]:
df_homes['Inspected'] = False # applies to all the rows

In [26]:
df_homes

           Address    Price  Bedrooms  Inspected
0      123 Main St   99,000         1      False
1  4981 Anytown Rd  199,000         4      False
2   132 Walrus ave  299,001         2      False
3    1506 Guido St  784,049         3      False
4    491 Python St  293,923         4      False
5      938 Zeal Rd  148,398         2      False
6      247 Fort St  299,238         3      False
7   992 Settled St  823,049         4      False

In [31]:
df_homes.sort_index() # sorts by index
df_homes.sort_values(by='Bedrooms')

           Address    Price  Bedrooms  Inspected
0      123 Main St   99,000         1      False
2   132 Walrus ave  299,001         2      False
5      938 Zeal Rd  148,398         2      False
3    1506 Guido St  784,049         3      False
6      247 Fort St  299,238         3      False
1  4981 Anytown Rd  199,000         4      False
4    491 Python St  293,923         4      False
7   992 Settled St  823,049         4      False

In [37]:
df_final=pd.concat([df1,df2,df_homes])  # contcates all the data frames

In [41]:
df_final.fillna('No Value', inplace=True)

In [45]:
# exporting to a .csv file
# pd.concat([df1,df2,df_homes]).to_csv('homes_1_comp_comp.csv')

#or

pd.concat([df_final]).to_csv('homes_1_comp_comp.csv', index=False)